pftbest/msp430_svd/msp430-gcc-support-files/include/msp430f5436a.h
/* UCBxIFG Control Bits */
#define UCNACKIFG              (0x0020)       /* NAK Condition interrupt Flag */
#define UCALIFG                (0x0010)       /* Arbitration Lost interrupt Flag */
#define UCSTPIFG               (0x0008)       /* STOP Condition interrupt Flag */
#define UCSTTIFG               (0x0004)       /* START Condition interrupt Flag */
#define UCTXIFG                (0x0002)       /* USCI Transmit Interrupt Flag */
#define UCRXIFG                (0x0001)       /* USCI Receive Interrupt Flag */

/* USCI Interrupt Vector Definitions */
#define USCI_NONE              (0x0000)       /* No Interrupt pending */
#define USCI_UCRXIFG           (0x0002)       /* Interrupt Vector: UCRXIFG */
#define USCI_UCTXIFG           (0x0004)       /* Interrupt Vector: UCTXIFG */
#define USCI_I2C_UCALIFG       (0x0002)       /* Interrupt Vector: I2C Mode: UCALIFG */
#define USCI_I2C_UCNACKIFG     (0x0004)       /* Interrupt Vector: I2C Mode: UCNACKIFG */
#define USCI_I2C_UCSTTIFG      (0x0006)       /* Interrupt Vector: I2C Mode: UCSTTIFG*/
#define USCI_I2C_UCSTPIFG      (0x0008)       /* Interrupt Vector: I2C Mode: UCSTPIFG*/
#define USCI_I2C_UCRXIFG       (0x000A)       /* Interrupt Vector: I2C Mode: UCRXIFG */
#define USCI_I2C_UCTXIFG       (0x000C)       /* Interrupt Vector: I2C Mode: UCTXIFG */

/************************************************************
* USCI A1
************************************************************/
#define __MSP430_HAS_USCI_A1__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A1__ 0x0600
#define USCI_A1_BASE           __MSP430_BASEADDRESS_USCI_A1__

sfr_w(UCA1CTLW0);                             /* USCI A1 Control Word Register 0 */
sfr_b(UCA1CTLW0_L);                           /* USCI A1 Control Word Register 0 */
sfr_b(UCA1CTLW0_H);                           /* USCI A1 Control Word Register 0 */
#define UCA1CTL1               UCA1CTLW0_L    /* USCI A1 Control Register 1 */
#define UCA1CTL0               UCA1CTLW0_H    /* USCI A1 Control Register 0 */
sfr_w(UCA1BRW);                               /* USCI A1 Baud Word Rate 0 */
sfr_b(UCA1BRW_L);                             /* USCI A1 Baud Word Rate 0 */
sfr_b(UCA1BRW_H);                             /* USCI A1 Baud Word Rate 0 */
#define UCA1BR0                UCA1BRW_L      /* USCI A1 Baud Rate 0 */
#define UCA1BR1                UCA1BRW_H      /* USCI A1 Baud Rate 1 */
sfr_b(UCA1MCTL);                              /* USCI A1 Modulation Control */
sfr_b(UCA1STAT);                              /* USCI A1 Status Register */
sfr_b(UCA1RXBUF);                             /* USCI A1 Receive Buffer */
sfr_b(UCA1TXBUF);                             /* USCI A1 Transmit Buffer */
sfr_b(UCA1ABCTL);                             /* USCI A1 LIN Control */
sfr_w(UCA1IRCTL);                             /* USCI A1 IrDA Transmit Control */
sfr_b(UCA1IRCTL_L);                           /* USCI A1 IrDA Transmit Control */
sfr_b(UCA1IRCTL_H);                           /* USCI A1 IrDA Transmit Control */
#define UCA1IRTCTL             UCA1IRCTL_L    /* USCI A1 IrDA Transmit Control */
#define UCA1IRRCTL             UCA1IRCTL_H    /* USCI A1 IrDA Receive Control */
sfr_w(UCA1ICTL);                              /* USCI A1 Interrupt Enable Register */
sfr_b(UCA1ICTL_L);                            /* USCI A1 Interrupt Enable Register */
sfr_b(UCA1ICTL_H);                            /* USCI A1 Interrupt Enable Register */
#define UCA1IE                 UCA1ICTL_L     /* USCI A1 Interrupt Enable Register */
#define UCA1IFG                UCA1ICTL_H     /* USCI A1 Interrupt Flags Register */
sfr_w(UCA1IV);                                /* USCI A1 Interrupt Vector Register */


/************************************************************
* USCI B1
************************************************************/
#define __MSP430_HAS_USCI_B1__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B1__ 0x0620
#define USCI_B1_BASE           __MSP430_BASEADDRESS_USCI_B1__


sfr_w(UCB1CTLW0);                             /* USCI B1 Control Word Register 0 */
sfr_b(UCB1CTLW0_L);                           /* USCI B1 Control Word Register 0 */
sfr_b(UCB1CTLW0_H);                           /* USCI B1 Control Word Register 0 */
#define UCB1CTL1               UCB1CTLW0_L    /* USCI B1 Control Register 1 */
#define UCB1CTL0               UCB1CTLW0_H    /* USCI B1 Control Register 0 */
sfr_w(UCB1BRW);                               /* USCI B1 Baud Word Rate 0 */
sfr_b(UCB1BRW_L);                             /* USCI B1 Baud Word Rate 0 */
sfr_b(UCB1BRW_H);                             /* USCI B1 Baud Word Rate 0 */
#define UCB1BR0                UCB1BRW_L      /* USCI B1 Baud Rate 0 */
#define UCB1BR1                UCB1BRW_H      /* USCI B1 Baud Rate 1 */
sfr_b(UCB1STAT);                              /* USCI B1 Status Register */
sfr_b(UCB1RXBUF);                             /* USCI B1 Receive Buffer */
sfr_b(UCB1TXBUF);                             /* USCI B1 Transmit Buffer */
sfr_w(UCB1I2COA);                             /* USCI B1 I2C Own Address */
sfr_b(UCB1I2COA_L);                           /* USCI B1 I2C Own Address */
sfr_b(UCB1I2COA_H);                           /* USCI B1 I2C Own Address */
sfr_w(UCB1I2CSA);                             /* USCI B1 I2C Slave Address */
sfr_b(UCB1I2CSA_L);                           /* USCI B1 I2C Slave Address */
sfr_b(UCB1I2CSA_H);                           /* USCI B1 I2C Slave Address */
sfr_w(UCB1ICTL);                              /* USCI B1 Interrupt Enable Register */
sfr_b(UCB1ICTL_L);                            /* USCI B1 Interrupt Enable Register */
sfr_b(UCB1ICTL_H);                            /* USCI B1 Interrupt Enable Register */
#define UCB1IE                 UCB1ICTL_L     /* USCI B1 Interrupt Enable Register */
#define UCB1IFG                UCB1ICTL_H     /* USCI B1 Interrupt Flags Register */
sfr_w(UCB1IV);                                /* USCI B1 Interrupt Vector Register */

/************************************************************
* USCI A2
************************************************************/
#define __MSP430_HAS_USCI_A2__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A2__ 0x0640
#define USCI_A2_BASE           __MSP430_BASEADDRESS_USCI_A2__

sfr_w(UCA2CTLW0);                             /* USCI A2 Control Word Register 0 */
sfr_b(UCA2CTLW0_L);                           /* USCI A2 Control Word Register 0 */
sfr_b(UCA2CTLW0_H);                           /* USCI A2 Control Word Register 0 */
#define UCA2CTL1               UCA2CTLW0_L    /* USCI A2 Control Register 1 */
#define UCA2CTL0               UCA2CTLW0_H    /* USCI A2 Control Register 0 */
sfr_w(UCA2BRW);                               /* USCI A2 Baud Word Rate 0 */
sfr_b(UCA2BRW_L);                             /* USCI A2 Baud Word Rate 0 */
sfr_b(UCA2BRW_H);                             /* USCI A2 Baud Word Rate 0 */
#define UCA2BR0                UCA2BRW_L      /* USCI A2 Baud Rate 0 */
#define UCA2BR1                UCA2BRW_H      /* USCI A2 Baud Rate 1 */
sfr_b(UCA2MCTL);                              /* USCI A2 Modulation Control */
sfr_b(UCA2STAT);                              /* USCI A2 Status Register */
sfr_b(UCA2RXBUF);                             /* USCI A2 Receive Buffer */
sfr_b(UCA2TXBUF);                             /* USCI A2 Transmit Buffer */
sfr_b(UCA2ABCTL);                             /* USCI A2 LIN Control */
sfr_w(UCA2IRCTL);                             /* USCI A2 IrDA Transmit Control */
sfr_b(UCA2IRCTL_L);                           /* USCI A2 IrDA Transmit Control */
sfr_b(UCA2IRCTL_H);                           /* USCI A2 IrDA Transmit Control */
#define UCA2IRTCTL             UCA2IRCTL_L    /* USCI A2 IrDA Transmit Control */
#define UCA2IRRCTL             UCA2IRCTL_H    /* USCI A2 IrDA Receive Control */
sfr_w(UCA2ICTL);                              /* USCI A2 Interrupt Enable Register */
sfr_b(UCA2ICTL_L);                            /* USCI A2 Interrupt Enable Register */
sfr_b(UCA2ICTL_H);                            /* USCI A2 Interrupt Enable Register */
#define UCA2IE                 UCA2ICTL_L     /* USCI A2 Interrupt Enable Register */
#define UCA2IFG                UCA2ICTL_H     /* USCI A2 Interrupt Flags Register */
sfr_w(UCA2IV);                                /* USCI A2 Interrupt Vector Register */


/************************************************************
* USCI B2
************************************************************/
#define __MSP430_HAS_USCI_B2__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B2__ 0x0660
#define USCI_B2_BASE           __MSP430_BASEADDRESS_USCI_B2__


sfr_w(UCB2CTLW0);                             /* USCI B2 Control Word Register 0 */
sfr_b(UCB2CTLW0_L);                           /* USCI B2 Control Word Register 0 */
sfr_b(UCB2CTLW0_H);                           /* USCI B2 Control Word Register 0 */
#define UCB2CTL1               UCB2CTLW0_L    /* USCI B2 Control Register 1 */
#define UCB2CTL0               UCB2CTLW0_H    /* USCI B2 Control Register 0 */
sfr_w(UCB2BRW);                               /* USCI B2 Baud Word Rate 0 */
sfr_b(UCB2BRW_L);                             /* USCI B2 Baud Word Rate 0 */
sfr_b(UCB2BRW_H);                             /* USCI B2 Baud Word Rate 0 */
#define UCB2BR0                UCB2BRW_L      /* USCI B2 Baud Rate 0 */
#define UCB2BR1                UCB2BRW_H      /* USCI B2 Baud Rate 1 */
sfr_b(UCB2STAT);                              /* USCI B2 Status Register */
sfr_b(UCB2RXBUF);                             /* USCI B2 Receive Buffer */
sfr_b(UCB2TXBUF);                             /* USCI B2 Transmit Buffer */
sfr_w(UCB2I2COA);                             /* USCI B2 I2C Own Address */
sfr_b(UCB2I2COA_L);                           /* USCI B2 I2C Own Address */
sfr_b(UCB2I2COA_H);                           /* USCI B2 I2C Own Address */
sfr_w(UCB2I2CSA);                             /* USCI B2 I2C Slave Address */
sfr_b(UCB2I2CSA_L);                           /* USCI B2 I2C Slave Address */
sfr_b(UCB2I2CSA_H);                           /* USCI B2 I2C Slave Address */
sfr_w(UCB2ICTL);                              /* USCI B2 Interrupt Enable Register */
sfr_b(UCB2ICTL_L);                            /* USCI B2 Interrupt Enable Register */
sfr_b(UCB2ICTL_H);                            /* USCI B2 Interrupt Enable Register */
#define UCB2IE                 UCB2ICTL_L     /* USCI B2 Interrupt Enable Register */
#define UCB2IFG                UCB2ICTL_H     /* USCI B2 Interrupt Flags Register */
sfr_w(UCB2IV);                                /* USCI B2 Interrupt Vector Register */

/************************************************************
* USCI A3
************************************************************/
#define __MSP430_HAS_USCI_A3__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A3__ 0x0680
#define USCI_A3_BASE           __MSP430_BASEADDRESS_USCI_A3__

sfr_w(UCA3CTLW0);                             /* USCI A3 Control Word Register 0 */
sfr_b(UCA3CTLW0_L);                           /* USCI A3 Control Word Register 0 */
sfr_b(UCA3CTLW0_H);                           /* USCI A3 Control Word Register 0 */
#define UCA3CTL1               UCA3CTLW0_L    /* USCI A3 Control Register 1 */
#define UCA3CTL0               UCA3CTLW0_H    /* USCI A3 Control Register 0 */
sfr_w(UCA3BRW);                               /* USCI A3 Baud Word Rate 0 */
sfr_b(UCA3BRW_L);                             /* USCI A3 Baud Word Rate 0 */
sfr_b(UCA3BRW_H);                             /* USCI A3 Baud Word Rate 0 */
#define UCA3BR0                UCA3BRW_L      /* USCI A3 Baud Rate 0 */
#define UCA3BR1                UCA3BRW_H      /* USCI A3 Baud Rate 1 */
sfr_b(UCA3MCTL);                              /* USCI A3 Modulation Control */
sfr_b(UCA3STAT);                              /* USCI A3 Status Register */
sfr_b(UCA3RXBUF);                             /* USCI A3 Receive Buffer */
sfr_b(UCA3TXBUF);                             /* USCI A3 Transmit Buffer */
sfr_b(UCA3ABCTL);                             /* USCI A3 LIN Control */
sfr_w(UCA3IRCTL);                             /* USCI A3 IrDA Transmit Control */
sfr_b(UCA3IRCTL_L);                           /* USCI A3 IrDA Transmit Control */
sfr_b(UCA3IRCTL_H);                           /* USCI A3 IrDA Transmit Control */
#define UCA3IRTCTL             UCA3IRCTL_L    /* USCI A3 IrDA Transmit Control */
#define UCA3IRRCTL             UCA3IRCTL_H    /* USCI A3 IrDA Receive Control */
sfr_w(UCA3ICTL);                              /* USCI A3 Interrupt Enable Register */
sfr_b(UCA3ICTL_L);                            /* USCI A3 Interrupt Enable Register */
sfr_b(UCA3ICTL_H);                            /* USCI A3 Interrupt Enable Register */
#define UCA3IE                 UCA3ICTL_L     /* USCI A3 Interrupt Enable Register */
#define UCA3IFG                UCA3ICTL_H     /* USCI A3 Interrupt Flags Register */
sfr_w(UCA3IV);                                /* USCI A3 Interrupt Vector Register */


/************************************************************
* USCI B3
************************************************************/
#define __MSP430_HAS_USCI_B3__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B3__ 0x06A0
#define USCI_B3_BASE           __MSP430_BASEADDRESS_USCI_B3__


sfr_w(UCB3CTLW0);                             /* USCI B3 Control Word Register 0 */
sfr_b(UCB3CTLW0_L);                           /* USCI B3 Control Word Register 0 */
sfr_b(UCB3CTLW0_H);                           /* USCI B3 Control Word Register 0 */
#define UCB3CTL1               UCB3CTLW0_L    /* USCI B3 Control Register 1 */
#define UCB3CTL0               UCB3CTLW0_H    /* USCI B3 Control Register 0 */
sfr_w(UCB3BRW);                               /* USCI B3 Baud Word Rate 0 */
sfr_b(UCB3BRW_L);                             /* USCI B3 Baud Word Rate 0 */
sfr_b(UCB3BRW_H);                             /* USCI B3 Baud Word Rate 0 */
#define UCB3BR0                UCB3BRW_L      /* USCI B3 Baud Rate 0 */
#define UCB3BR1                UCB3BRW_H      /* USCI B3 Baud Rate 1 */
sfr_b(UCB3STAT);                              /* USCI B3 Status Register */
sfr_b(UCB3RXBUF);                             /* USCI B3 Receive Buffer */
sfr_b(UCB3TXBUF);                             /* USCI B3 Transmit Buffer */
sfr_w(UCB3I2COA);                             /* USCI B3 I2C Own Address */
sfr_b(UCB3I2COA_L);                           /* USCI B3 I2C Own Address */
sfr_b(UCB3I2COA_H);                           /* USCI B3 I2C Own Address */
sfr_w(UCB3I2CSA);                             /* USCI B3 I2C Slave Address */
sfr_b(UCB3I2CSA_L);                           /* USCI B3 I2C Slave Address */
sfr_b(UCB3I2CSA_H);                           /* USCI B3 I2C Slave Address */
sfr_w(UCB3ICTL);                              /* USCI B3 Interrupt Enable Register */
sfr_b(UCB3ICTL_L);                            /* USCI B3 Interrupt Enable Register */
sfr_b(UCB3ICTL_H);                            /* USCI B3 Interrupt Enable Register */
#define UCB3IE                 UCB3ICTL_L     /* USCI B3 Interrupt Enable Register */
#define UCB3IFG                UCB3ICTL_H     /* USCI B3 Interrupt Flags Register */
sfr_w(UCB3IV);                                /* USCI B3 Interrupt Vector Register */

/************************************************************
* WATCHDOG TIMER A
************************************************************/
#define __MSP430_HAS_WDT_A__                  /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_WDT_A__ 0x0150
#define WDT_A_BASE             __MSP430_BASEADDRESS_WDT_A__

sfr_w(WDTCTL);                                /* Watchdog Timer Control */
sfr_b(WDTCTL_L);                              /* Watchdog Timer Control */
sfr_b(WDTCTL_H);                              /* Watchdog Timer Control */
/* The bit names have been prefixed with "WDT" */
/* WDTCTL Control Bits */
#define WDTIS0                 (0x0001)       /* WDT - Timer Interval Select 0 */
#define WDTIS1                 (0x0002)       /* WDT - Timer Interval Select 1 */
#define WDTIS2                 (0x0004)       /* WDT - Timer Interval Select 2 */
#define WDTCNTCL               (0x0008)       /* WDT - Timer Clear */
#define WDTTMSEL               (0x0010)       /* WDT - Timer Mode Select */
#define WDTSSEL0               (0x0020)       /* WDT - Timer Clock Source Select 0 */
#define WDTSSEL1               (0x0040)       /* WDT - Timer Clock Source Select 1 */
#define WDTHOLD                (0x0080)       /* WDT - Timer hold */

/* WDTCTL Control Bits */
#define WDTIS0_L               (0x0001)       /* WDT - Timer Interval Select 0 */
#define WDTIS1_L               (0x0002)       /* WDT - Timer Interval Select 1 */
#define WDTIS2_L               (0x0004)       /* WDT - Timer Interval Select 2 */
#define WDTCNTCL_L             (0x0008)       /* WDT - Timer Clear */
#define WDTTMSEL_L             (0x0010)       /* WDT - Timer Mode Select */
#define WDTSSEL0_L             (0x0020)       /* WDT - Timer Clock Source Select 0 */
#define WDTSSEL1_L             (0x0040)       /* WDT - Timer Clock Source Select 1 */
#define WDTHOLD_L              (0x0080)       /* WDT - Timer hold */

#define WDTPW                  (0x5A00)

#define WDTIS_0                (0x0000)       /* WDT - Timer Interval Select: /2G */
#define WDTIS_1                (0x0001)       /* WDT - Timer Interval Select: /128M */
#define WDTIS_2                (0x0002)       /* WDT - Timer Interval Select: /8192k */
#define WDTIS_3                (0x0003)       /* WDT - Timer Interval Select: /512k */
#define WDTIS_4                (0x0004)       /* WDT - Timer Interval Select: /32k */
#define WDTIS_5                (0x0005)       /* WDT - Timer Interval Select: /8192 */
#define WDTIS_6                (0x0006)       /* WDT - Timer Interval Select: /512 */
#define WDTIS_7                (0x0007)       /* WDT - Timer Interval Select: /64 */
#define WDTIS__2G              (0x0000)       /* WDT - Timer Interval Select: /2G */
#define WDTIS__128M            (0x0001)       /* WDT - Timer Interval Select: /128M */
#define WDTIS__8192K           (0x0002)       /* WDT - Timer Interval Select: /8192k */
#define WDTIS__512K            (0x0003)       /* WDT - Timer Interval Select: /512k */
#define WDTIS__32K             (0x0004)       /* WDT - Timer Interval Select: /32k */
#define WDTIS__8192            (0x0005)       /* WDT - Timer Interval Select: /8192 */
#define WDTIS__512             (0x0006)       /* WDT - Timer Interval Select: /512 */
#define WDTIS__64              (0x0007)       /* WDT - Timer Interval Select: /64 */

#define WDTSSEL_0              (0x0000)       /* WDT - Timer Clock Source Select: SMCLK */
#define WDTSSEL_1              (0x0020)       /* WDT - Timer Clock Source Select: ACLK */
#define WDTSSEL_2              (0x0040)       /* WDT - Timer Clock Source Select: VLO_CLK */
#define WDTSSEL_3              (0x0060)       /* WDT - Timer Clock Source Select: reserved */
#define WDTSSEL__SMCLK         (0x0000)       /* WDT - Timer Clock Source Select: SMCLK */
#define WDTSSEL__ACLK          (0x0020)       /* WDT - Timer Clock Source Select: ACLK */
#define WDTSSEL__VLO           (0x0040)       /* WDT - Timer Clock Source Select: VLO_CLK */

